socialNetwork/wrk2/client-external-with-istio/rps_200.txt
Running 1m test @ http://128.199.25.250:31111//wrk2-api/post/compose
  2 threads and 100 connections
  Thread calibration: mean lat.: 1738.949ms, rate sampling interval: 5017ms
  Thread calibration: mean lat.: 1812.622ms, rate sampling interval: 5185ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     8.95s     4.10s   17.55s    61.32%
    Req/Sec    73.44      3.39    79.00     77.78%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    9.01s 
 75.000%   12.19s 
 90.000%   14.45s 
 99.000%   17.55s 
 99.900%   19.04s 
 99.990%   19.42s 
 99.999%   19.64s 
100.000%   19.64s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     679.423     0.000000            1         1.00
    3418.111     0.100000          751         1.11
    4804.607     0.200000         1502         1.25
    6070.271     0.300000         2253         1.43
    7577.599     0.400000         3002         1.67
    9011.199     0.500000         3754         2.00
    9650.175     0.550000         4133         2.22
   10272.767     0.600000         4506         2.50
   10944.511     0.650000         4882         2.86
   11575.295     0.700000         5255         3.33
   12189.695     0.750000         5634         4.00
   12484.607     0.775000         5817         4.44
   12836.863     0.800000         6006         5.00
   13205.503     0.825000         6193         5.71
   13533.183     0.850000         6380         6.67
   13983.743     0.875000         6567         8.00
   14147.583     0.887500         6664         8.89
   14450.687     0.900000         6756        10.00
   14680.063     0.912500         6850        11.43
   15007.743     0.925000         6948        13.33
   15286.271     0.937500         7036        16.00
   15499.263     0.943750         7084        17.78
   15630.335     0.950000         7132        20.00
   15843.327     0.956250         7177        22.86
   16064.511     0.962500         7224        26.67
   16195.583     0.968750         7271        32.00
   16326.655     0.971875         7294        35.56
   16556.031     0.975000         7319        40.00
   16752.639     0.978125         7343        45.71
   16990.207     0.981250         7365        53.33
   17154.047     0.984375         7388        64.00
   17317.887     0.985938         7400        71.11
   17416.191     0.987500         7413        80.00
   17530.879     0.989062         7425        91.43
   17563.647     0.990625         7435       106.67
   17760.255     0.992188         7448       128.00
   17825.791     0.992969         7453       142.22
   17874.943     0.993750         7459       160.00
   18038.783     0.994531         7464       182.86
   18071.551     0.995313         7470       213.33
   18235.391     0.996094         7476       256.00
   18350.079     0.996484         7479       284.44
   18399.231     0.996875         7482       320.00
   18513.919     0.997266         7485       365.71
   18628.607     0.997656         7489       426.67
   18857.983     0.998047         7492       512.00
   18857.983     0.998242         7492       568.89
   18907.135     0.998437         7494       640.00
   18923.519     0.998633         7495       731.43
   19038.207     0.998828         7497       853.33
   19054.591     0.999023         7498      1024.00
   19087.359     0.999121         7499      1137.78
   19136.511     0.999219         7501      1280.00
   19136.511     0.999316         7501      1462.86
   19136.511     0.999414         7501      1706.67
   19202.047     0.999512         7502      2048.00
   19202.047     0.999561         7502      2275.56
   19251.199     0.999609         7503      2560.00
   19251.199     0.999658         7503      2925.71
   19251.199     0.999707         7503      3413.33
   19415.039     0.999756         7504      4096.00
   19415.039     0.999780         7504      4551.11
   19415.039     0.999805         7504      5120.00
   19415.039     0.999829         7504      5851.43
   19415.039     0.999854         7504      6826.67
   19644.415     0.999878         7505      8192.00
   19644.415     1.000000         7505          inf
#[Mean    =     8947.721, StdDeviation   =     4101.619]
#[Max     =    19628.032, Total count    =         7505]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  8987 requests in 1.00m, 2.51MB read
Requests/sec:    149.76
Transfer/sec:     42.86KB